// ==================================
// ===== ГЛОБАЛЬНЫЕ ДАННЫЕ =====
// ==================================

// Все задачи из базы
let TASKS = [];

// История переписки с AI
let HISTORY = [];

// Счетчик подсказок
let HINT_LEVEL = 0;


// ==================================
// ===== ЗАГРУЗКА ЗАДАЧ =====
// ==================================

async function loadTasks() {

    // Запрашиваем задачи у FastAPI

    const response = await fetch(
        "/tasks"
    );

    // Превращаем JSON в JS объект

    TASKS = await response.json();

    // Заполняем список классов

    fillGroups();
}


// ==================================
// ===== ЗАГРУЗКА ПРИ СТАРТЕ =====
// ==================================

autoResize(
    document.getElementById("solution")
);

loadTasks();