// ==================================
// ===== ГЛОБАЛЬНЫЕ ДАННЫЕ =====
// ==================================

// Все задачи из базы
let TASKS = [];

// История переписки с AI
let HISTORY = [];


// ==================================
// ===== ЗАГРУЗКА ЗАДАЧ =====
// ==================================

async function loadTasks() {

    // Запрашиваем задачи у FastAPI

    const response = await fetch(
        "http://127.0.0.1:8000/tasks"
    );

    // Превращаем JSON в JS объект

    TASKS = await response.json();

    // Заполняем список классов

    fillGroups();
}


// ==================================
// ===== ЗАГРУЗКА ПРИ СТАРТЕ =====
// ==================================

autoResize(
    document.getElementById("solution")
);

loadTasks();